
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
//
// =====ДОДАТКОВО 1=======
//
//     зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//     1. перебрати його циклом while
//     2. перебрати його циклом for
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 10
// створити пустий масив та :
//     - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.
//
//
// 1. Створити пустий масив та :
//     a. заповнити його 50 парними числами за допомоги циклу.
//     b. заповнити його 50 непарними числами за допомоги циклу.
//     c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)
// d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732 (Google: Generate random number JS)
// 2. Вивести за допомогою console.log кожен третій елемен
// 3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.
// 4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив
// 5. Вивести кожен елемент масиву, сусід справа якого є парним
// EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56
// 6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.
//
// 7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// 8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо елемент є числом - додати його в інший масив.


// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.






//--------------------------------------------------------------------------------------------
// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
let mass = ['a', 'b', 'c'];
for (let i = 0; i < mass.length; i++) {
    mass[i] = mass[i] + 1;
}
//--------------------------------------------------------------------------------------------
// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
let mass2 = [1, 2, 3];
let massRev = [];
let ret = 0;
for (let i = mass2.length - 1; i >= 0; i--) {
    massRev[ret++] = mass2[i]
}
for (let i = 0; i < massRev.length; i++) {
    mass2[i] = massRev[i];
}
//--------------------------------------------------------------------------------------------
// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [4, 5].
let mass3 = [1, 2, 3, 4, 5];
let ret2 = 0;
for (let i = 3; i < mass3.length; i++) {
    mass3[ret2++] = mass3[i];
}
for (let i = 2; i < mass3.length; i++) {
    mass3[i] = undefined;
}
//--------------------------------------------------------------------------------------------
// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [1,2].
let mass4 = [1, 2, 3, 4, 5];
for (let i = 0; i < mass3.length; i++) {
    if (i >= 2) {
        mass4[i] = undefined;
    }
}
//--------------------------------------------------------------------------------------------
// - Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 2, 3, 'a', 'b', 'c'].
let mass5 = [1, 2, 3, 4, 5];
for (let i = 0; i < mass5.length + 1; i++) {
    if (i === 3) {
        mass5[i] = 'a';
    }
    if (i === 4){
        mass5[i] = 'b';
    }
    if (i === 5){
        mass5[i] = 'c';
    }
}
//--------------------------------------------------------------------------------------------
// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
let mass6 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
let ret3 = 0
while (mass6.length > ret3){
    //забув як ставити НЕ дорівнює !% не паше, тому замутив через елс
    if (mass6[ret3] % 2){
    } else {
        console.log(mass6[ret3]);
    }
    ret3++;
}
//--------------------------------------------------------------------------------------------
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
let mass7 = [11, 22, 33, 44, 55, 66, 77, 88, 99, 100];
let mass8 = [];
for (let i = 0; i < mass7.length; i++) {
    mass7[i] = mass8.push(mass7[i]);
}









